// Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами.
// Напишите программу, которая покажет количество чётных чисел в массиве.
Console.WriteLine("--------------Задача №34.--------------");
int[] array = GetArray(7, 100, 999);
Console.WriteLine(String.Join(", ", array));
Console.WriteLine($"В данном массиве кол-во четных чисел = {FindEvenNumbers(array)}");

int FindEvenNumbers(int[] array)
{
    int count = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i] % 2 == 0)
        {
            count++;
        }
    }
    return count;
}

// Задача 36: Задайте одномерный массив, заполненный случайными числами.
// Найдите сумму элементов, стоящих на нечётных позициях.
Console.WriteLine("--------------Задача №36.--------------");
int[] arr = GetArray(6, -100, 100);
Console.WriteLine(String.Join(", ", arr));
Console.WriteLine($"{SumOddNumber(arr)}");

int SumOddNumber(int[] array)
{
    int sum = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (i % 2 != 0)
        {
            sum = sum + array[i];
        }
    }
    return sum;
}

int[] GetArray(int size, int minValue, int maxValue)
{
    int[] res = new int[size];

    for (int i = 0; i < size; i++)
    {
        res[i] = new Random().Next(minValue, maxValue + 1);
    }
    return res;
}
